# Дан список чисел.Опредеоите, сколько
# в нем встречается различных чисел.

# [1,1,2,0,-1,3,4,4]

# 6

list_1 = [1, 2, 3, 1, 1, 5, 10, 20, 20, 30]
list_1 = len(set(list_1))

print(list_1)